tutorials/CFD/11UnsteadyBBOpen/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Adiabatic_walls
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Left
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Right
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Inlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    Outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type empty;
    }

}


// ************************************************************************* //
